In [2]:
import pandas as pd
df4=pd.read_html("https://stats.espncricinfo.com/ci/content/records/223375.html")

In [4]:
type([df4])

list

In [7]:
cri_data = df4[0]

In [9]:
cri_data.head(4)

,Player,Span,Mat,Runs,HS,Ave,100,Wkts,BBI,Ave.1,5,Ct,St
0,SR Tendulkar (IND),1989-2012,463,18426,200*,44.83,49,154,5/32,44.48,2,140,0
1,DPMD Jayawardene (Asia/SL),1998-2015,448,12650,144,33.37,19,8,2/56,70.37,0,218,0
2,ST Jayasuriya (Asia/SL),1989-2011,445,13430,189,32.36,28,323,6/29,36.75,4,123,0
3,KC Sangakkara (Asia/ICC/SL),2000-2015,404,14234,169,41.98,25,-,-,-,-,402,99

In [13]:
cri_data.tail(5)

,Player,Span,Mat,Runs,HS,Ave,100,Wkts,BBI,Ave.1,5,Ct,St
80,MN Samuels (WI),2000-2018,207,5606,133*,32.97,10,89,3/12,46.37,0,50,0
81,BRM Taylor (ZIM),2004-2021,205,6684,145*,35.55,11,9,3/54,45.11,0,133,29
82,CA Walsh (WI),1985-2000,205,321,30,6.97,0,227,5/1,30.47,1,27,0
83,Z Khan (Asia/IND),2000-2012,200,792,34*,12.00,0,282,5/42,29.43,1,43,0
84,HP Tillakaratne (SL),1986-2003,200,3789,104,29.60,2,6,1/3,23.50,0,89,6

In [15]:
cri_data.columns

Index(['Player', 'Span', 'Mat', 'Runs', 'HS', 'Ave', '100', 'Wkts', 'BBI',
       'Ave.1', '5', 'Ct', 'St'],
      dtype='object')

In [19]:
cri_data[['Player','Mat','HS']]

                          Player  Mat    HS
0             SR Tendulkar (IND)  463  200*
1     DPMD Jayawardene (Asia/SL)  448   144
2        ST Jayasuriya (Asia/SL)  445   189
3    KC Sangakkara (Asia/ICC/SL)  404   169
4   Shahid Afridi (Asia/ICC/PAK)  398   124
..                           ...  ...   ...
80               MN Samuels (WI)  207  133*
81              BRM Taylor (ZIM)  205  145*
82                 CA Walsh (WI)  205    30
83             Z Khan (Asia/IND)  200   34*
84          HP Tillakaratne (SL)  200   104

[85 rows x 3 columns]

In [26]:
list1=[4,8,15,16,23,42]
df5=list1

AttributeError: module 'pandas' has no attribute 'df5'

In [27]:
type([list1])

list

In [28]:
df5=list1

In [29]:
df5.head()

AttributeError: 'list' object has no attribute 'head'

In [30]:
import pandas as pd
ser=pd.Series()
print(ser)

Series([], dtype: float64)

/tmp/ipykernel_3198/39034586.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser=pd.Series()

In [32]:
import pandas as pd
import numpy as np
 
 
# Creating empty series
ser = pd.Series()
   
print(ser)
 
# simple array
data = np.array(['4', '8', '15', '16', '23','42'])
   
ser = pd.Series(data)
print(ser)

Series([], dtype: float64)
0     4
1     8
2    15
3    16
4    23
5    42
dtype: object

/tmp/ipykernel_3198/4063737942.py:6: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series()

In [34]:
list1=[5,10,15,20,25,30,35,40,45,50]
print(list1)

[5, 10, 15, 20, 25, 30, 35, 40, 45, 50]

In [39]:
pd.DataFrame(list1)

    0
0   5
1  10
2  15
3  20
4  25
5  30
6  35
7  40
8  45
9  50

In [72]:
name=["Amit","Ragini","Raginipandey"]
age=['19','20','23']
Salary=["20K","35K","1 Cr"]
df1=pd.DataFrame(name)
name.append(age)

name.append(Salary)

d=pd.DataFrame(name)
d[0]

0                Amit
1              Ragini
2        Raginipandey
3        [19, 20, 23]
4    [20K, 35K, 1 Cr]
Name: 0, dtype: object

NameError: name 'dtypes' is not defined

In [103]:
data={'Name':['John','jane','bob'],
      'Age':[25,30,35],
      'Salary':[20000,30000,40000],
     'Location':['Varanasi','Gangkala','Bhadohi']}
df6=pd.DataFrame(data)

df7=df6.reindex([2,1,0])
print(df7)
for index, row in df7.iterrows():
    print(row['Name'],row['Age'])

   Name  Age  Salary  Location
2   bob   35   40000   Bhadohi
1  jane   30   30000  Gangkala
0  John   25   20000  Varanasi
bob 35
jane 30
John 25